

	 Лабораторная работа №7
	 

 
Читайте также:Am286: производится по лицензии, но работает быстрееI. Контрольная работаII. Поработать с лекционным материалом по теме занятия, выучить глоссарий.II. Работа с раздаточным материаломIII. Поработать с лекционным материалом по теме занятия. Выучить глоссарий.MS Excel. Основные приемы работы. Простые расчеты. Работа со встроенными функциями.V. Положение о контрольных работахV. Самостоятельная аудиторная работа студентов под контролем и при консультации преподавателяV. Самостоятельная аудиторная работа студентов под контролем и при консультации преподавателяV. Самостоятельная аудиторная работа студентов под контролем и при консультации преподавателяV. Самостоятельная аудиторная работа студентов под контролем и при консультации преподавателяV. Самостоятельная аудиторная работа студентов под контролем и при консультации преподавателя






 
					Программирование циклических вычислительных процессов
					 
					Справочная информация
					При усложнении решаемых задач ход выполнения программ становится более запутанным. Чтобы иметь возможность управлять процессом выполнения программ его организацией используются такие структуры как циклы. Циклы необходимы. Когда надо повторить некоторые действия несколько раз, как правило, пока выполняется некоторое условие. В языке С известно три вида оператора цикла: for, while и do-while.
   
					Цикл for
					Основная форма цикла for имеет следующий вид:
   
					For (инициализация ; проверка условия ; изменение ) оператор ; где
					 
  Инициализация – это присвоение начального значения параметру цикла и счетчику.
  Проверка условия – условное выражение, которое определяет, когда цикл должен
  быть завершен.
  Изменение – это приращение параметра цикла каждый раз при повторение цикла.
  Выполнение цикла происходит до тех пор, пока условное выражение истинно. Как условие становится ложным. Начинает выполняться следующий за циклом for оператор.
   
					Цикл while
					Основная форма оператора while имеет вид:
   
  While (условие) оператор;
   
  Где оператор может быть простым, составным или пустым оператором. «Условие», как и в других операторах, является просто выражением. Цикл выполняется до тех пор, пока условие принимает значение “истинно”. Когда же условие “ложно”. Программа передает управление следующему оператору программы. В цикле while сначала проверяется условие, а затем выполняется оператор. Этот цикл называют циклом с предусловием.
   
					Цикл do-while
					В отличие от предыдущих циклов в цикле do-while условие проверяется в конце оператора цикла. Основная форма оператора do-while следующая:
   
  Do {
					Последовательность операторов
					} while (условие);
   
  Фигурные скобки в данной конструкции необязательны, если внутри них находится один оператор. Оператор do-while называется оператором цикла с постусловием. Какое бы условие ни стояло в конце оператора, набор операторов в фигурных скобках один раз выполнится обязательно. В циклах for и while оператор может не выполниться ни разу.
	
   
					Задание
					1.  Наберите и запустите следующую ниже программу. Разберитесь в тексте программы. Изучите работу оператора цикла for.
   
  // Программа вычисления суммы первых n целых положительных чисел
  #include<stdio.h>
  # include<conio.h>
  void main()
  { int n; //количество суммируемых чисел
  int summ; //сумма
  int i; //счетчик циклов
   
  printf(“Вычисление суммы положительных чисел \n”);
  printf(“Введите количество суммируемых чисел ”);
  scanf(“%d”,&n);
  summ = 0
  for ( i = 1; i <= n; i++)
  summ = summ + 1;
  printf(“Сумма первых %d целых положительных чисел “, n);
  printf(“равна %d “, summ);
  printf(“\n\nДля завершения работы нажмите <Enter>“);
  getch();
  }
  2.  Измените программу, используя вместо оператора цикла for оператор цикла while.
  3.  Измените программу, используя вместо оператора цикла for оператор цикла do-while.
  4.  Самостоятельно напишите программу, которая выводит на экран ваши имя и фамилию 10 раз.
  5.  Самостоятельно напишите программу, которая выводит таблицу квадратов первых десяти целых положительных чисел. Ниже приведен рекомендуемый вид экрана во время работы программы.
  _____________________
  Таблица квадратов
  _____________________
  Число Квадрат
  _____________________
  1 1
  2 4
  3 9
  4 16
  5 25
  6 36
  7 49
  8 64
  9 81
  10 100
  _____________________



Лабораторная работа №6  | следующая ==> Справочная информация
Дата добавления: 2015-10-22; просмотров: 10; Опубликованный материал нарушает авторские права?.

Не нашли то, что искали? Воспользуйтесь поиском:
Не хотите "париться"? закажите платную работу!
	     
  